tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
brew "bat"
brew "python@3.9"
brew "ctags"
brew "curl"
brew "d2"
brew "dbus"
brew "docker"
brew "expat"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gradle"
brew "jq"
brew "k9s"
brew "kotlin"
brew "kotlin-language-server"
brew "kubernetes-cli"
brew "libiconv"
brew "libxml2"
brew "luajit"
brew "mailutils"
brew "multimarkdown"
brew "mysql"
brew "tree-sitter"
brew "neovim"
brew "node"
brew "openjdk@17"
brew "pyenv"
brew "rbenv"
brew "ripgrep"
brew "ruby"
brew "subversion"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tmuxinator"
brew "vips"
brew "wget"
brew "yt-dlp"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-native-comp"]
cask "alfred"
cask "appcleaner"
cask "cyberduck"
cask "dropbox"
cask "google-chrome"
cask "gureumkim"
cask "iterm2"
cask "keycastr"
cask "mactex"
cask "naver-whale"
cask "notion"
cask "obsidian"
cask "openinterminal"
cask "slack"
cask "textmate"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
