tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "romkatv/powerlevel10k"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "asciinema"
brew "asdf"
brew "bat"
brew "unbound"
brew "qemu"
brew "lima"
brew "colima"
brew "ctags"
brew "curl"
brew "dbus"
brew "docker"
brew "docker-compose"
brew "expat"
brew "fd"
brew "openjpeg"
brew "leptonica"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gitui"
brew "openjdk"
brew "gradle"
brew "groovy"
brew "helm"
brew "jq"
brew "k9s"
brew "kcat"
brew "kotlin"
brew "openjdk@17"
brew "kotlin-language-server"
brew "kubernetes-cli"
brew "kube-ps1"
brew "kubectx"
brew "lazygit"
brew "libiconv"
brew "libxml2"
brew "lua"
brew "luajit"
brew "mailutils"
brew "multimarkdown"
brew "tree-sitter"
brew "neovim"
brew "node"
brew "openjdk@11"
brew "pipenv"
brew "powerlevel10k"
brew "python@3.9"
brew "rabbitmq", restart_service: true
brew "redis"
brew "ripgrep"
brew "subversion"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tmuxinator"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "yq"
brew "zookeeper"
cask "alacritty"
cask "alfred"
cask "another-redis-desktop-manager"
cask "appcleaner"
cask "bartender"
cask "firefox"
cask "gitkraken"
cask "google-chrome"
cask "google-drive"
cask "gureumkim"
cask "intellij-idea"
cask "iterm2"
cask "keycastr"
cask "notion"
cask "obsidian"
cask "openinterminal"
cask "openlens"
cask "rapidapi"
cask "slack"
cask "spotify"
cask "steam"
cask "studio-3t"
cask "textmate"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
cask "zoom"
vscode "Angular.ng-template"
vscode "fwcd.kotlin"
vscode "mathiasfrohlich.Kotlin"
vscode "MS-CEINTL.vscode-language-pack-ko"
vscode "ms-vscode.vscode-typescript-next"
vscode "redhat.java"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
