tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "romkatv/powerlevel10k"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "bat"
brew "colima"
brew "ctags"
brew "curl"
brew "dbus"
brew "docker"
brew "docker-compose"
brew "expat"
brew "fd"
brew "openjpeg"
brew "leptonica"
brew "ffmpeg"
brew "fzf"
brew "openjdk@17"
brew "gradle"
brew "groovy"
brew "helm"
brew "jq"
brew "kotlin"
brew "openjdk@11"
brew "kotlin-language-server"
brew "kubernetes-cli"
brew "kube-ps1"
brew "kubectx"
brew "libiconv"
brew "libxml2"
brew "luajit"
brew "mailutils"
brew "multimarkdown"
brew "tree-sitter"
brew "neovim"
brew "node"
brew "python@3.9"
brew "rabbitmq", restart_service: true
brew "redis"
brew "ripgrep"
brew "subversion"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tmuxinator"
brew "wget"
brew "youtube-dl"
brew "romkatv/powerlevel10k/powerlevel10k"
cask "alfred"
cask "another-redis-desktop-manager"
cask "appcleaner"
cask "bartender"
cask "firefox"
cask "gitkraken"
cask "google-chrome"
cask "google-drive"
cask "gureumkim"
cask "intellij-idea"
cask "iterm2"
cask "keycastr"
cask "naver-whale"
cask "notion"
cask "obsidian"
cask "openinterminal"
cask "openlens"
cask "rapidapi"
cask "slack"
cask "spotify"
cask "steam"
cask "studio-3t"
cask "textmate"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
