tap "argoproj/tap"
tap "d12frosted/emacs-plus"
tap "dkos/dkosctl", "https://github.daumkakao.com/DKOS/homebrew-dkosctl"
tap "eugene-babichenko/fixit"
tap "mongodb/brew"
tap "oven-sh/bun"
tap "raine/workmux"
tap "romkatv/powerlevel10k"
tap "steipete/tap"
brew "harfbuzz"
brew "xz"
brew "little-cms2"
brew "openjdk"
brew "ant"
brew "jpeg-xl"
brew "webp"
brew "openssl@3"
brew "asciinema"
brew "libiconv"
brew "asdf"
brew "bash"
brew "bat"
brew "bat-extras"
brew "lima"
brew "colima"
brew "ctags"
brew "curl"
brew "dateutils"
brew "dbus"
brew "dive"
brew "dnsmasq"
brew "docker", link: false
brew "docker-compose"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "gifsicle"
brew "git-delta"
brew "tmux"
brew "gitmux"
brew "gitui"
brew "unbound"
brew "go"
brew "gradle"
brew "groovy"
brew "helm"
brew "htop"
brew "icu4c@76"
brew "imagemagick"
brew "jq"
brew "k6"
brew "k9s"
brew "kcat"
brew "kotlin"
brew "openjdk@21"
brew "kotlin-language-server"
brew "kubernetes-cli"
brew "kube-ps1"
brew "kubectx"
brew "kustomize"
brew "lazygit"
brew "openjpeg"
brew "leptonica"
brew "libffi"
brew "libxml2"
brew "lua"
brew "luajit"
brew "mailutils"
brew "mise"
brew "node"
brew "multimarkdown"
brew "zlib"
brew "mysql"
brew "neovim"
brew "ripgrep"
brew "opencode"
brew "openjdk@11"
brew "openjdk@17"
brew "openvino"
brew "pandoc"
brew "pipenv"
brew "poppler"
brew "powerlevel10k"
brew "python@3.9"
brew "qemu"
brew "rabbitmq", restart_service: :changed
brew "reattach-to-user-namespace"
brew "redis"
brew "resvg"
brew "rust"
brew "scala"
brew "screenfetch"
brew "sevenzip"
brew "stern"
brew "subversion"
brew "tesseract"
brew "the_silver_searcher"
brew "tldr"
brew "tmuxinator"
brew "tree-sitter"
brew "vhs"
brew "watch"
brew "wget"
brew "yarn"
brew "yazi"
brew "yq"
brew "zookeeper"
brew "zoxide"
brew "zsh-syntax-highlighting"
brew "argoproj/tap/kubectl-argo-rollouts"
brew "dkos/dkosctl/dkosctl"
brew "eugene-babichenko/fixit/fixit"
brew "mongodb/brew/mongodb-database-tools"
brew "mongodb/brew/mongodb-community"
brew "oven-sh/bun/bun"
brew "raine/workmux/workmux"
cask "alfred"
cask "another-redis-desktop-manager"
cask "appcleaner"
cask "chatgpt"
cask "claude"
cask "steipete/tap/codexbar"
cask "cursor"
cask "datagrip"
cask "docker-desktop"
cask "d12frosted/emacs-plus/emacs-plus-app"
cask "firefox"
cask "font-d2coding"
cask "font-d2coding-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-source-code-pro"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "gitkraken"
cask "gitkraken-cli"
cask "google-chrome"
cask "google-drive"
cask "gureumkim"
cask "hammerspoon"
cask "iina"
cask "iterm2"
cask "karabiner-elements"
cask "keycastr"
cask "maccy"
cask "notion"
cask "obsidian"
cask "openinterminal"
cask "openlens"
cask "proxyman"
cask "rapidapi"
cask "redis-insight"
cask "shottr"
cask "slack"
cask "spotify"
cask "steam"
cask "textmate"
cask "visual-studio-code"
cask "vlc"
cask "xquartz"
cask "zoom"
vscode "angular.ng-template"
vscode "anthropic.claude-code"
vscode "atlassian.atlascode"
vscode "catppuccin.catppuccin-vsc"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "fwcd.kotlin"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "guodongsun.vscode-git-cruise"
vscode "kruemelkatze.vscode-dashboard"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "naco-siren.gradle-language"
vscode "openai.chatgpt"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-lombok"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
go "github.com/kakao/kubectl-cilium"
