tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "mongodb/brew"
tap "romkatv/powerlevel10k"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "asciinema"
brew "asdf"
brew "bat"
brew "unbound"
brew "qemu"
brew "lima"
brew "colima"
brew "ctags"
brew "curl"
brew "dbus"
brew "dive"
brew "docker"
brew "docker-compose"
brew "expat"
brew "fd"
brew "openjpeg"
brew "leptonica"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "gifsicle"
brew "gitui"
brew "gradle"
brew "groovy"
brew "helm"
brew "jq"
brew "k9s"
brew "kcat"
brew "kotlin"
brew "kotlin-language-server"
brew "kubernetes-cli"
brew "kube-ps1"
brew "kubectx"
brew "kustomize"
brew "lazygit"
brew "libiconv"
brew "libxml2"
brew "lua"
brew "luajit"
brew "mailutils"
brew "node"
brew "multimarkdown"
brew "mysql"
brew "tree-sitter"
brew "neovim"
brew "openjdk@11"
brew "openjdk@17"
brew "pipenv"
brew "powerlevel10k"
brew "python@3.9"
brew "rabbitmq", restart_service: true
brew "redis"
brew "ripgrep"
brew "scala"
brew "screenfetch"
brew "subversion"
brew "the_silver_searcher"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tmuxinator"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "yq"
brew "zookeeper"
brew "mongodb/brew/mongodb-community"
cask "alfred"
cask "another-redis-desktop-manager"
cask "appcleaner"
cask "bartender"
cask "firefox"
cask "font-source-code-pro"
cask "gitkraken"
cask "google-chrome"
cask "google-drive"
cask "gureumkim"
cask "intellij-idea"
cask "keycastr"
cask "notion"
cask "obsidian"
cask "openinterminal"
cask "openlens"
cask "proxyman"
cask "rapidapi"
cask "slack"
cask "spotify"
cask "steam"
cask "studio-3t"
cask "textmate"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
cask "xquartz"
cask "zoom"
vscode "angular.ng-template"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bradlc.vscode-tailwindcss"
vscode "dsznajder.es7-react-js-snippets"
vscode "ecmel.vscode-html-css"
vscode "fwcd.kotlin"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ipedrazas.kubernetes-snippets"
vscode "kubernetes-tools.k8s"
vscode "mathiasfrohlich.kotlin"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ko"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.vscode-typescript-next"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
